
&Поле(1)
&ЕщеАннотация
&Поле(2)
Перем ПолеЭкспортное Экспорт;

&АннотацияКонструктора(Параметр1 = 1, Параметр2 = "2", Параметр1 = "3")
&АннотацияВерхнеуровневая
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры

&ПриватныйМетод(1)
&Метод
Процедура МетодПриватный()
	
КонецПроцедуры

&ЭкспортныйМетод
&Метод("1")
Процедура МетодЭкспортный() Экспорт
	
КонецПроцедуры

&ТестоваяАннотация(1, 2)
Процедура МетодСНесколькимиНеПовторяемымиЗначениями()
КонецПроцедуры

&ТестоваяАннотацияСПовторяемымЗначением(1, 2)
Процедура МетодСНесколькимиПовторяемымиЗначениями()
КонецПроцедуры
