#Использовать ".."
#Использовать "."
#Использовать asserts

&Тест
Процедура ПсевдонимПереноситПереданноеЗначениеВМетаАннотацию() Экспорт

	// Дано
	Метод = НайтиМетод("МетодСПсевдонимом");
	КонтейнерАннотаций = ПодготовитьКонтейнер();

	// Когда
	РазворачивательАннотаций = КонтейнерАннотаций.ПолучитьРазворачивательАннотаций();
	РазворачивательАннотаций.РазвернутьАннотацииСвойства(Метод, Тип("ВладелецАннотаций"));

	// Тогда
	Ожидаем.Что(Метод.Аннотации.Количество()).Равно(2);

	ЦельАннотация = РаботаСАннотациями.НайтиАннотацию(Метод.Аннотации, "Цель");
	Ожидаем.Что(ЦельАннотация).ИмеетТип("СтрокаТаблицыЗначений");

	Значение = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(ЦельАннотация, "Значение");
	Ожидаем.Что(Значение).Равно("переопределённое значение");

	ОбъектЦели = КонтейнерАннотаций.ПолучитьОпределениеАннотации("Цель").СоздатьОбъектАннотации(ЦельАннотация);
	Ожидаем.Что(ОбъектЦели.УстановленноеЗначение).Равно("переопределённое значение");

КонецПроцедуры

&Тест
Процедура ПсевдонимПереноситЗначениеПоУмолчаниюВМетаАннотацию() Экспорт

	// Дано
	Метод = НайтиМетод("МетодСПсевдонимомПоУмолчанию");
	КонтейнерАннотаций = ПодготовитьКонтейнер();

	// Когда
	РазворачивательАннотаций = КонтейнерАннотаций.ПолучитьРазворачивательАннотаций();
	РазворачивательАннотаций.РазвернутьАннотацииСвойства(Метод, Тип("ВладелецАннотаций"));

	// Тогда
	ЦельАннотация = РаботаСАннотациями.НайтиАннотацию(Метод.Аннотации, "Цель");
	Ожидаем.Что(ЦельАннотация).ИмеетТип("СтрокаТаблицыЗначений");

	Значение = РаботаСАннотациями.ПолучитьЗначениеПараметраАннотации(ЦельАннотация, "Значение");
	Ожидаем.Что(Значение).Равно("значение композита по умолчанию");

КонецПроцедуры

Функция ПодготовитьКонтейнер()
	КонтейнерАннотаций = Новый КонтейнерАннотаций();
	КонтейнерАннотаций.ДобавитьАннотацию(Тип("АннотацияЦель"));
	КонтейнерАннотаций.ДобавитьАннотацию(Тип("АннотацияКомпозит"));
	Возврат КонтейнерАннотаций;
КонецФункции

Функция НайтиМетод(ИмяМетода)

	Рефлектор = Новый Рефлектор();
	ТаблицаМетодов = Рефлектор.ПолучитьТаблицуМетодов(Тип("ВладелецАннотаций"));
	Возврат ТаблицаМетодов.Найти(ИмяМетода, "Имя");

КонецФункции
