#Использовать ".."
#Использовать "."
#Использовать asserts

&Тест
Процедура РазвернутьАннотацииСвойств() Экспорт
	
	// Дано
	КонтейнерАннотаций = Новый КонтейнерАннотаций();
	Рефлектор = Новый Рефлектор();
	ТаблицаМетодов = Рефлектор.ПолучитьТаблицуМетодов(Тип("ВладелецАннотаций"));
	Методы = РаботаСАннотациями.НайтиМетодыСАннотацией(ТаблицаМетодов, "АннотацияВерхнеуровневая");
	
	// Когда
	КонтейнерАннотаций.ДобавитьАннотацию(Тип("АннотацияТестоваяАннотация"));
	КонтейнерАннотаций.ДобавитьАннотацию(Тип("АннотацияВерхнеуровневая"));
	РазворачивательАннотаций = КонтейнерАннотаций.ПолучитьРазворачивательАннотаций();
	РазворачивательАннотаций.РазвернутьАннотацииСвойств(Методы, Тип("ВладелецАннотаций"));

	Аннотации = Методы[0].Аннотации;

	// Тогда
	Ожидаем.Что(Аннотации.Количество()).Равно(3);
	Ожидаем.Что(Аннотации[2].Имя).Равно("тестоваяаннотация");
	Ожидаем.Что(Аннотации[2].Параметры[0].Значение).Равно(1);
	
КонецПроцедуры
